НВ_Доработки/Documents/СнятиеРезервов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СнятиеРезервов</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДокументРезерва</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

НВ_Доработки/AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

НВ_Доработки/Documents/СнятиеРезервов/Ext/ObjectModule.bsl
&После("ОбработкаПроведения")
Процедура НВД_ОбработкаПроведения(Отказ, РежимПроведения)

	ТЗЗаказовПокапателей = Товары.Выгрузить(,"ДокументРезерва");
	ТЗЗаказовПокапателей.Свернуть("ДокументРезерва");
	МассивЗаказовПокупателей = ТЗЗаказовПокапателей.ВыгрузитьКолонку("ДокументРезерва");

	// Создаём типизированную таблицу значений для фильтра
	ТаблицаФильтра = Новый ТаблицаЗначений;
	ТаблицаФильтра.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаФильтра.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаФильтра.Колонки.Добавить("СерияНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	ТаблицаФильтра.Колонки.Добавить("ВидТабличнойЧасти", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыТабличнойЧасти"));

	// Заполняем из табличной части "Товары" одноимёнными колонками
	Для Каждого СтрокаТовары Из Товары Цикл
		НоваяСтрока = ТаблицаФильтра.Добавить();
		НоваяСтрока.Номенклатура = СтрокаТовары.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры = СтрокаТовары.ХарактеристикаНоменклатуры;
		НоваяСтрока.СерияНоменклатуры = СтрокаТовары.СерияНоменклатуры;
		НоваяСтрока.ВидТабличнойЧасти = СтрокаТовары.ВидТабличнойЧасти;
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаФильтра.Номенклатура КАК Номенклатура,
		|	ТаблицаФильтра.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ТаблицаФильтра.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ТаблицаФильтра.ВидТабличнойЧасти КАК ВидТабличнойЧасти
		|ПОМЕСТИТЬ ВТ_ТаблицаФильтра
		|ИЗ
		|	&ТаблицаФильтра КАК ТаблицаФильтра
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыВРезервеНаСкладах.Регистратор КАК ЗаказПокупателя
		|ИЗ
		|	РегистрНакопления.ТоварыВРезервеНаСкладах КАК ТоварыВРезервеНаСкладах
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаФильтра КАК ВТ_ТаблицаФильтра
		|		ПО ТоварыВРезервеНаСкладах.Номенклатура = ВТ_ТаблицаФильтра.Номенклатура
		|			И ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры = ВТ_ТаблицаФильтра.ХарактеристикаНоменклатуры
		|			И ТоварыВРезервеНаСкладах.СерияНоменклатуры = ВТ_ТаблицаФильтра.СерияНоменклатуры
		|			И ТоварыВРезервеНаСкладах.ВидТабличнойЧасти = ВТ_ТаблицаФильтра.ВидТабличнойЧасти
		|ГДЕ
		|	ТоварыВРезервеНаСкладах.ДокументРезерва В(&МассивЗаказовПокупателей)
		|	И ТИПЗНАЧЕНИЯ(ТоварыВРезервеНаСкладах.Регистратор) = ТИП(Документ.Резервирование)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВРезервеНаСкладах.Регистратор";

	Запрос.УстановитьПараметр("МассивЗаказовПокупателей", МассивЗаказовПокупателей);
	Запрос.УстановитьПараметр("ТаблицаФильтра", ТаблицаФильтра);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если НЕ ОбщийМодульВызовСервера.НВД_ИзменитьСтатусДокументаРезервирование(ВыборкаДетальныеЗаписи.ЗаказПокупателя, Справочники.СтатусыРезервирований.Отменен) Тогда
			Сообщить("Не удалось сменить статус документа Резервирование: " + ВыборкаДетальныеЗаписи.ЗаказПокупателя);
			Отказ = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура НВД_ОбработкаУдаленияПроведения(Отказ)
	ТЗЗаказовПокапателей = Товары.Выгрузить(,"ДокументРезерва");
	ТЗЗаказовПокапателей.Свернуть("ДокументРезерва");
	МассивЗаказовПокупателей = ТЗЗаказовПокапателей.ВыгрузитьКолонку("ДокументРезерва");
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыВРезервеНаСкладах.Регистратор КАК Резервирование
		|ИЗ
		|	РегистрНакопления.ТоварыВРезервеНаСкладах КАК ТоварыВРезервеНаСкладах
		|ГДЕ
		|	ТоварыВРезервеНаСкладах.ДокументРезерва В (&МассивЗаказовПокупателей)
		|   И ТИПЗНАЧЕНИЯ(ТоварыВРезервеНаСкладах.Регистратор) = ТИП(Документ.Резервирование)";
	
	Запрос.УстановитьПараметр("МассивЗаказовПокупателей", МассивЗаказовПокупателей);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		СтатусДокумента = Справочники.СтатусыРезервирований.ВРаботе;

		Если НЕ ОбщийМодульВызовСервера.НВД_ИзменитьСтатусДокументаРезервирование(ВыборкаДетальныеЗаписи.Резервирование, СтатусДокумента) Тогда
			Сообщить("Не удалось сменить статус документа Резервирование: " + ВыборкаДетальныеЗаписи.ЗаказПокупателя);
			Отказ = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры 

Функция НВД_ВсеРезервыСписаныПоДокументуРезерва(Резервирование)
	
	ВсёСписано = Истина;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РезервыПоставленные.Склад КАК Склад,
	|	РезервыПоставленные.Номенклатура КАК Номенклатура,
	|	РезервыПоставленные.ХарактеристикаНоменклатуры КАК Характеристика,
	|	РезервыПоставленные.СерияНоменклатуры КАК СерияНоменклатуры,
	|	РезервыПоставленные.ВидТабличнойЧасти КАК ВидТабличнойЧасти,
	|	РезервыПоставленные.ДокументРезерва КАК ДокументРезерва,
	|	ЕСТЬNULL(РезервыСписанные.КоличествоПриход, 0) КАК КоличествоВРезервеВсего,
	|	РезервыПоставленные.КоличествоПриход КАК КоличествоВРезервеТекущимДокументом,
	|	ЕСТЬNULL(РезервыСписанные.КоличествоРасход, 0) КАК КоличествоСписанныхРезервов,
	|	-(ЕСТЬNULL(РезервыСписанные.КоличествоПриход, 0) - РезервыПоставленные.КоличествоПриход - ЕСТЬNULL(РезервыСписанные.КоличествоРасход, 0)) КАК СписаноТекущимДокументом
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Обороты(, , Авто, ) КАК РезервыПоставленные
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Обороты() КАК РезервыСписанные
	|		ПО РезервыПоставленные.Склад = РезервыСписанные.Склад
	|			И РезервыПоставленные.Номенклатура = РезервыСписанные.Номенклатура
	|			И РезервыПоставленные.ХарактеристикаНоменклатуры = РезервыСписанные.ХарактеристикаНоменклатуры
	|			И РезервыПоставленные.СерияНоменклатуры = РезервыСписанные.СерияНоменклатуры
	|			И РезервыПоставленные.ВидТабличнойЧасти = РезервыСписанные.ВидТабличнойЧасти
	|			И РезервыПоставленные.ДокументРезерва = РезервыСписанные.ДокументРезерва
	|
	|ГДЕ
	|	РезервыПоставленные.Регистратор = &Ссылка
	|	И -(ЕСТЬNULL(РезервыСписанные.КоличествоПриход, 0) - РезервыПоставленные.КоличествоПриход - ЕСТЬNULL(РезервыСписанные.КоличествоРасход, 0)) > 0
	|";
	Запрос.УстановитьПараметр("Ссылка", Резервирование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ВсёСписано = Ложь;
		
		Сообщить(СтрШаблон("По %1, по позиции %2%3%4 уже списаны резервы."
			, Выборка.ДокументРезерва
			, Выборка.Номенклатура
			, ?(ЗначениеЗаполнено(Выборка.Характеристика), ", " + Выборка.Характеристика, "") 
			, ?(ЗначениеЗаполнено(Выборка.СерияНоменклатуры), ", " + Выборка.СерияНоменклатуры, "")
		));
		
	КонецЦикла;
	
	Возврат ВсёСписано;
	
КонецФункции
